/***********************************************************************************************************************
Copyright: 
FileName: DebugLog.cpp   
Author:        Version :          Date:   
Description:    
Version:         
Function List:    
History:               
<author>   <time>   <version >   <desc>       
 ------    14/25/8   1.0.0.0     build this file 
************************************************************************************************************************/
#include "DebugLog.h"


static S8 g_ModuleList[DM_MAX+1][20] = 
{
	"MediaSrv     ",
	"Unknow       "
};

static S8 g_LevelList[DL_MAX+1][20] = 
{
	"Info         ",
	"Warning      ",
	"Error        ",
	"Unknow       "
};


/***********************************************************************************************************************
Function:     
Description:    // 函数功能、性能等的描述   
Called By:      // 调用本函数的函数清单       
Input:          // 输入参数说明，包括每个参数的作
Output:         // 对输出参数的说明。   
Return:         // 函数返回值的说明   
Others:         // 其它说明  
************************************************************************************************************************/